; ModuleID = 'memcached_bpf_kern.c'
source_filename = "memcached_bpf_kern.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.anon = type { [6 x i32]*, i32*, %struct.memcached_key*, [31 x i32]* }
%struct.memcached_key = type { i32, [250 x i8], i32 }
%struct.anon.0 = type { [2 x i32]*, i32*, %struct.memcached_cache_entry*, [2777777 x i32]* }
%struct.memcached_cache_entry = type { %struct.bpf_spin_lock, i32, i8, i32, i32, [403 x i8] }
%struct.bpf_spin_lock = type { i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.udphdr = type { i16, i16, i16, i16 }
%struct.tcphdr = type { i16, i16, i32, i32, i16, i16, i16, i16 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.4 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.1 }
%union.anon.1 = type { %struct.anon.3 }
%struct.anon.3 = type { [4 x i32], [4 x i32] }
%union.anon.4 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32, i32, [4 x i32], i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "map_parsing_context", scope: !2, file: !3, line: 90, type: !58, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !55, nameTableKind: None)
!3 = !DIFile(filename: "memcached_bpf_kern.c", directory: "/home/leif/stage/bmc-cache/bmc2")
!4 = !{}
!5 = !{!6, !7, !8, !22, !13, !15, !46, !48, !50, !51, !53}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !10, line: 23, size: 64, elements: !11)
!10 = !DIFile(filename: "./linux/include/uapi/linux/udp.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!11 = !{!12, !18, !19, !20}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !9, file: !10, line: 24, baseType: !13, size: 16)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !14, line: 30, baseType: !15)
!14 = !DIFile(filename: "./linux/include/uapi/linux/types.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !16, line: 24, baseType: !17)
!16 = !DIFile(filename: "./linux/include/uapi/asm-generic/int-ll64.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!17 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !9, file: !10, line: 25, baseType: !13, size: 16, offset: 16)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !9, file: !10, line: 26, baseType: !13, size: 16, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !9, file: !10, line: 27, baseType: !21, size: 16, offset: 48)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !14, line: 36, baseType: !15)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !24, line: 25, size: 160, elements: !25)
!24 = !DIFile(filename: "./linux/include/uapi/linux/tcp.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!25 = !{!26, !27, !28, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !23, file: !24, line: 26, baseType: !13, size: 16)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !23, file: !24, line: 27, baseType: !13, size: 16, offset: 16)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !23, file: !24, line: 28, baseType: !29, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !14, line: 32, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !16, line: 27, baseType: !31)
!31 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !23, file: !24, line: 29, baseType: !29, size: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !23, file: !24, line: 31, baseType: !15, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !23, file: !24, line: 32, baseType: !15, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !23, file: !24, line: 33, baseType: !15, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !23, file: !24, line: 34, baseType: !15, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !23, file: !24, line: 35, baseType: !15, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !23, file: !24, line: 36, baseType: !15, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !23, file: !24, line: 37, baseType: !15, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !23, file: !24, line: 38, baseType: !15, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !23, file: !24, line: 39, baseType: !15, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !23, file: !24, line: 40, baseType: !15, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !23, file: !24, line: 55, baseType: !13, size: 16, offset: 112)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !23, file: !24, line: 56, baseType: !21, size: 16, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !23, file: !24, line: 57, baseType: !13, size: 16, offset: 144)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !52, line: 21, baseType: !30)
!52 = !DIFile(filename: "./linux/include/asm-generic/int-ll64.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !52, line: 19, baseType: !15)
!55 = !{!0, !56, !68, !70, !72, !77, !111, !137, !144, !149, !154, !160, !162, !164}
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "map_stats", scope: !2, file: !3, line: 98, type: !58, isLocal: false, isDefinition: true)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !59, line: 246, size: 224, elements: !60)
!59 = !DIFile(filename: "./linux/tools/testing/selftests/bpf/bpf_helpers.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!60 = !{!61, !62, !63, !64, !65, !66, !67}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !59, line: 247, baseType: !31, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !58, file: !59, line: 248, baseType: !31, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !58, file: !59, line: 249, baseType: !31, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !58, file: !59, line: 250, baseType: !31, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !58, file: !59, line: 251, baseType: !31, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_idx", scope: !58, file: !59, line: 252, baseType: !31, size: 32, offset: 160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !58, file: !59, line: 253, baseType: !31, size: 32, offset: 192)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "map_progs_xdp", scope: !2, file: !3, line: 106, type: !58, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "map_progs_tc", scope: !2, file: !3, line: 113, type: !58, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 688, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 4)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "map_kcache", scope: !2, file: !3, line: 66, type: !79, isLocal: false, isDefinition: true)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 61, size: 256, elements: !80)
!80 = !{!81, !86, !88, !106}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !3, line: 62, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 2)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !79, file: !3, line: 63, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !79, file: !3, line: 64, baseType: !89, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memcached_cache_entry", file: !91, line: 40, size: 3392, elements: !92)
!91 = !DIFile(filename: "./memcached_bpf_common.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!92 = !{!93, !98, !99, !100, !101, !102}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !90, file: !91, line: 41, baseType: !94, size: 32)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_spin_lock", file: !95, line: 3548, size: 32, elements: !96)
!95 = !DIFile(filename: "./linux/include/uapi/linux/bpf.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !94, file: !95, line: 3549, baseType: !30, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !90, file: !91, line: 42, baseType: !31, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !90, file: !91, line: 43, baseType: !47, size: 8, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !90, file: !91, line: 44, baseType: !31, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "challenger", scope: !90, file: !91, line: 45, baseType: !31, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !91, line: 46, baseType: !103, size: 3224, offset: 160)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 3224, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 403)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !79, file: !3, line: 65, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 88888864, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 2777777)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "map_keys", scope: !2, file: !3, line: 81, type: !113, isLocal: false, isDefinition: true)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 76, size: 256, elements: !114)
!114 = !{!115, !120, !122, !132}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !3, line: 77, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 192, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 6)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !113, file: !3, line: 78, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !113, file: !3, line: 79, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memcached_key", file: !3, line: 70, size: 2080, elements: !125)
!125 = !{!126, !127, !131}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !124, file: !3, line: 71, baseType: !51, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !124, file: !3, line: 72, baseType: !128, size: 2000, offset: 32)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2000, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 250)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !124, file: !3, line: 73, baseType: !31, size: 32, offset: 2048)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !113, file: !3, line: 80, baseType: !133, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 992, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 31)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !59, line: 23, type: !139, isLocal: true, isDefinition: true)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!6, !6, !142}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_head", scope: !2, file: !59, line: 82, type: !146, isLocal: true, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!50, !6, !50}
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "bpf_tail_call", scope: !2, file: !59, line: 43, type: !151, isLocal: true, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !6, !6, !50}
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "bpf_spin_lock", scope: !2, file: !59, line: 191, type: !156, isLocal: true, isDefinition: true)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "bpf_spin_unlock", scope: !2, file: !59, line: 193, type: !156, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_tail", scope: !2, file: !59, line: 131, type: !146, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !59, line: 41, type: !166, isLocal: true, isDefinition: true)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!50, !169, !50, null}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!171 = !{i32 2, !"Dwarf Version", i32 4}
!172 = !{i32 2, !"Debug Info Version", i32 3}
!173 = !{i32 1, !"wchar_size", i32 4}
!174 = !{!"clang version 9.0.1-12 "}
!175 = distinct !DISubprogram(name: "xdp_memcached_rx_main", scope: !3, file: !3, line: 136, type: !176, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !186)
!176 = !DISubroutineType(types: !177)
!177 = !{!50, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !95, line: 3123, size: 160, elements: !180)
!180 = !{!181, !182, !183, !184, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !95, line: 3124, baseType: !30, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !179, file: !95, line: 3125, baseType: !30, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !179, file: !95, line: 3126, baseType: !30, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !179, file: !95, line: 3128, baseType: !30, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !179, file: !95, line: 3129, baseType: !30, size: 32, offset: 128)
!186 = !{!187, !188, !189, !190, !200, !217, !218, !219, !220, !221, !222, !227, !243, !251}
!187 = !DILocalVariable(name: "ctx", arg: 1, scope: !175, file: !3, line: 136, type: !178)
!188 = !DILocalVariable(name: "data_end", scope: !175, file: !3, line: 138, type: !6)
!189 = !DILocalVariable(name: "data", scope: !175, file: !3, line: 139, type: !6)
!190 = !DILocalVariable(name: "eth", scope: !175, file: !3, line: 140, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !193, line: 163, size: 112, elements: !194)
!193 = !DIFile(filename: "./linux/include/uapi/linux/if_ether.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!194 = !{!195, !198, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !192, file: !193, line: 164, baseType: !196, size: 48)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 48, elements: !118)
!197 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !192, file: !193, line: 165, baseType: !196, size: 48, offset: 48)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !192, file: !193, line: 166, baseType: !13, size: 16, offset: 96)
!200 = !DILocalVariable(name: "ip", scope: !175, file: !3, line: 141, type: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !203, line: 86, size: 160, elements: !204)
!203 = !DIFile(filename: "./linux/include/uapi/linux/ip.h", directory: "/home/leif/stage/bmc-cache/bmc2")
!204 = !{!205, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !202, file: !203, line: 88, baseType: !206, size: 4, flags: DIFlagBitField, extraData: i64 0)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !16, line: 21, baseType: !197)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !202, file: !203, line: 89, baseType: !206, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !202, file: !203, line: 96, baseType: !206, size: 8, offset: 8)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !202, file: !203, line: 97, baseType: !13, size: 16, offset: 16)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !202, file: !203, line: 98, baseType: !13, size: 16, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !202, file: !203, line: 99, baseType: !13, size: 16, offset: 48)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !202, file: !203, line: 100, baseType: !206, size: 8, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !202, file: !203, line: 101, baseType: !206, size: 8, offset: 72)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !202, file: !203, line: 102, baseType: !21, size: 16, offset: 80)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !202, file: !203, line: 103, baseType: !29, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !202, file: !203, line: 104, baseType: !29, size: 32, offset: 128)
!217 = !DILocalVariable(name: "transp", scope: !175, file: !3, line: 142, type: !6)
!218 = !DILocalVariable(name: "udp", scope: !175, file: !3, line: 143, type: !8)
!219 = !DILocalVariable(name: "tcp", scope: !175, file: !3, line: 144, type: !22)
!220 = !DILocalVariable(name: "payload", scope: !175, file: !3, line: 145, type: !46)
!221 = !DILocalVariable(name: "dport", scope: !175, file: !3, line: 146, type: !13)
!222 = !DILocalVariable(name: "zero", scope: !223, file: !3, line: 172, type: !31)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 171, column: 120)
!224 = distinct !DILexicalBlock(scope: !225, file: !3, line: 171, column: 7)
!225 = distinct !DILexicalBlock(scope: !226, file: !3, line: 169, column: 54)
!226 = distinct !DILexicalBlock(scope: !175, file: !3, line: 169, column: 6)
!227 = !DILocalVariable(name: "stats", scope: !223, file: !3, line: 173, type: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memcached_bpf_stats", file: !91, line: 49, size: 384, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "get_recv_count", scope: !229, file: !91, line: 50, baseType: !31, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "set_recv_count", scope: !229, file: !91, line: 51, baseType: !31, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "get_resp_count", scope: !229, file: !91, line: 52, baseType: !31, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "hit_misprediction", scope: !229, file: !91, line: 53, baseType: !31, size: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "hit_count", scope: !229, file: !91, line: 54, baseType: !31, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "miss_count", scope: !229, file: !91, line: 55, baseType: !31, size: 32, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "update_count", scope: !229, file: !91, line: 56, baseType: !31, size: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "invalidation_count", scope: !229, file: !91, line: 57, baseType: !31, size: 32, offset: 224)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "hot_replace_hot", scope: !229, file: !91, line: 58, baseType: !31, size: 32, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "cold_replace_cold", scope: !229, file: !91, line: 59, baseType: !31, size: 32, offset: 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "hot_replace_cold", scope: !229, file: !91, line: 60, baseType: !31, size: 32, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cold_replace_hot", scope: !229, file: !91, line: 61, baseType: !31, size: 32, offset: 352)
!243 = !DILocalVariable(name: "pctx", scope: !223, file: !3, line: 179, type: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parsing_context", file: !3, line: 84, size: 96, elements: !246)
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "key_count", scope: !245, file: !3, line: 85, baseType: !31, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "current_key", scope: !245, file: !3, line: 86, baseType: !31, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "read_pkt_offset", scope: !245, file: !3, line: 87, baseType: !17, size: 16, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "write_pkt_offset", scope: !245, file: !3, line: 88, baseType: !17, size: 16, offset: 80)
!251 = !DILocalVariable(name: "off", scope: !223, file: !3, line: 187, type: !31)
!252 = !DILocation(line: 0, scope: !175)
!253 = !DILocation(line: 138, column: 38, scope: !175)
!254 = !{!255, !256, i64 4}
!255 = !{!"xdp_md", !256, i64 0, !256, i64 4, !256, i64 8, !256, i64 12, !256, i64 16}
!256 = !{!"int", !257, i64 0}
!257 = !{!"omnipotent char", !258, i64 0}
!258 = !{!"Simple C/C++ TBAA"}
!259 = !DILocation(line: 138, column: 27, scope: !175)
!260 = !DILocation(line: 138, column: 19, scope: !175)
!261 = !DILocation(line: 139, column: 34, scope: !175)
!262 = !{!255, !256, i64 0}
!263 = !DILocation(line: 139, column: 23, scope: !175)
!264 = !DILocation(line: 139, column: 15, scope: !175)
!265 = !DILocation(line: 147, column: 9, scope: !266)
!266 = distinct !DILexicalBlock(scope: !175, file: !3, line: 147, column: 6)
!267 = !DILocation(line: 147, column: 15, scope: !266)
!268 = !DILocation(line: 147, column: 13, scope: !266)
!269 = !DILocation(line: 147, column: 6, scope: !175)
!270 = !DILocation(line: 150, column: 14, scope: !175)
!271 = !{!272, !257, i64 9}
!272 = !{!"iphdr", !257, i64 0, !257, i64 0, !257, i64 1, !273, i64 2, !273, i64 4, !273, i64 6, !257, i64 8, !257, i64 9, !273, i64 10, !256, i64 12, !256, i64 16}
!273 = !{!"short", !257, i64 0}
!274 = !DILocation(line: 150, column: 2, scope: !175)
!275 = !DILocation(line: 153, column: 12, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 153, column: 8)
!277 = distinct !DILexicalBlock(scope: !175, file: !3, line: 150, column: 24)
!278 = !DILocation(line: 153, column: 18, scope: !276)
!279 = !DILocation(line: 153, column: 16, scope: !276)
!280 = !DILocation(line: 153, column: 8, scope: !277)
!281 = !DILocation(line: 156, column: 36, scope: !277)
!282 = !DILocation(line: 157, column: 4, scope: !277)
!283 = !DILocation(line: 160, column: 12, scope: !284)
!284 = distinct !DILexicalBlock(scope: !277, file: !3, line: 160, column: 8)
!285 = !DILocation(line: 160, column: 18, scope: !284)
!286 = !DILocation(line: 160, column: 16, scope: !284)
!287 = !DILocation(line: 160, column: 8, scope: !277)
!288 = !DILocation(line: 0, scope: !277)
!289 = !{!273, !273, i64 0}
!290 = !DILocation(line: 169, column: 12, scope: !226)
!291 = !DILocation(line: 169, column: 38, scope: !226)
!292 = !DILocation(line: 169, column: 41, scope: !226)
!293 = !DILocation(line: 169, column: 28, scope: !226)
!294 = !DILocation(line: 171, column: 35, scope: !224)
!295 = !DILocation(line: 171, column: 38, scope: !224)
!296 = !{!257, !257, i64 0}
!297 = !DILocation(line: 171, column: 49, scope: !224)
!298 = !DILocation(line: 171, column: 56, scope: !224)
!299 = !DILocation(line: 171, column: 59, scope: !224)
!300 = !DILocation(line: 171, column: 70, scope: !224)
!301 = !DILocation(line: 171, column: 77, scope: !224)
!302 = !DILocation(line: 171, column: 80, scope: !224)
!303 = !DILocation(line: 171, column: 91, scope: !224)
!304 = !DILocation(line: 171, column: 98, scope: !224)
!305 = !DILocation(line: 171, column: 101, scope: !224)
!306 = !DILocation(line: 171, column: 112, scope: !224)
!307 = !DILocation(line: 171, column: 7, scope: !225)
!308 = !DILocation(line: 172, column: 4, scope: !223)
!309 = !DILocation(line: 0, scope: !223)
!310 = !DILocation(line: 172, column: 17, scope: !223)
!311 = !{!256, !256, i64 0}
!312 = !DILocation(line: 173, column: 40, scope: !223)
!313 = !DILocation(line: 174, column: 9, scope: !314)
!314 = distinct !DILexicalBlock(scope: !223, file: !3, line: 174, column: 8)
!315 = !DILocation(line: 174, column: 8, scope: !223)
!316 = !DILocation(line: 177, column: 11, scope: !223)
!317 = !DILocation(line: 177, column: 25, scope: !223)
!318 = !{!319, !256, i64 0}
!319 = !{!"memcached_bpf_stats", !256, i64 0, !256, i64 4, !256, i64 8, !256, i64 12, !256, i64 16, !256, i64 20, !256, i64 24, !256, i64 28, !256, i64 32, !256, i64 36, !256, i64 40, !256, i64 44}
!320 = !DILocation(line: 179, column: 35, scope: !223)
!321 = !DILocation(line: 180, column: 9, scope: !322)
!322 = distinct !DILexicalBlock(scope: !223, file: !3, line: 180, column: 8)
!323 = !DILocation(line: 180, column: 8, scope: !223)
!324 = !DILocation(line: 183, column: 10, scope: !223)
!325 = !DILocation(line: 183, column: 20, scope: !223)
!326 = !{!327, !256, i64 0}
!327 = !{!"parsing_context", !256, i64 0, !256, i64 4, !273, i64 8, !273, i64 10}
!328 = !DILocation(line: 184, column: 10, scope: !223)
!329 = !DILocation(line: 184, column: 22, scope: !223)
!330 = !{!327, !256, i64 4}
!331 = !DILocation(line: 185, column: 10, scope: !223)
!332 = !DILocation(line: 185, column: 27, scope: !223)
!333 = !{!327, !273, i64 10}
!334 = !DILocation(line: 189, column: 42, scope: !335)
!335 = distinct !DILexicalBlock(scope: !336, file: !3, line: 189, column: 4)
!336 = distinct !DILexicalBlock(scope: !223, file: !3, line: 189, column: 4)
!337 = !DILocation(line: 189, column: 52, scope: !335)
!338 = !DILocation(line: 189, column: 56, scope: !335)
!339 = !DILocation(line: 189, column: 59, scope: !335)
!340 = !DILocation(line: 189, column: 71, scope: !335)
!341 = !DILocation(line: 189, column: 74, scope: !335)
!342 = !DILocation(line: 189, column: 87, scope: !335)
!343 = !DILocation(line: 189, column: 4, scope: !336)
!344 = !DILocation(line: 189, column: 98, scope: !335)
!345 = !DILocation(line: 189, column: 22, scope: !335)
!346 = distinct !{!346, !343, !347, !348}
!347 = !DILocation(line: 189, column: 103, scope: !336)
!348 = !{!"llvm.loop.unroll.disable"}
!349 = !DILocation(line: 191, column: 29, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !3, line: 190, column: 33)
!351 = distinct !DILexicalBlock(scope: !223, file: !3, line: 190, column: 8)
!352 = !DILocation(line: 191, column: 11, scope: !350)
!353 = !DILocation(line: 191, column: 27, scope: !350)
!354 = !{!327, !273, i64 8}
!355 = !DILocation(line: 192, column: 29, scope: !356)
!356 = distinct !DILexicalBlock(scope: !350, file: !3, line: 192, column: 9)
!357 = !DILocation(line: 192, column: 114, scope: !356)
!358 = !DILocation(line: 192, column: 9, scope: !356)
!359 = !DILocation(line: 192, column: 9, scope: !350)
!360 = !DILocation(line: 194, column: 5, scope: !350)
!361 = !DILocation(line: 195, column: 4, scope: !350)
!362 = !DILocation(line: 196, column: 3, scope: !224)
!363 = !DILocation(line: 198, column: 18, scope: !364)
!364 = distinct !DILexicalBlock(scope: !365, file: !3, line: 197, column: 41)
!365 = distinct !DILexicalBlock(scope: !224, file: !3, line: 197, column: 12)
!366 = !DILocation(line: 198, column: 4, scope: !364)
!367 = !DILocation(line: 199, column: 3, scope: !364)
!368 = !DILocation(line: 203, column: 1, scope: !175)
!369 = distinct !DISubprogram(name: "xdp_memcached_rx_get_parse_main", scope: !3, file: !3, line: 207, type: !176, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !386}
!371 = !DILocalVariable(name: "ctx", arg: 1, scope: !369, file: !3, line: 207, type: !178)
!372 = !DILocalVariable(name: "data_end", scope: !369, file: !3, line: 209, type: !6)
!373 = !DILocalVariable(name: "data", scope: !369, file: !3, line: 210, type: !6)
!374 = !DILocalVariable(name: "payload", scope: !369, file: !3, line: 211, type: !46)
!375 = !DILocalVariable(name: "zero", scope: !369, file: !3, line: 212, type: !31)
!376 = !DILocalVariable(name: "pctx", scope: !369, file: !3, line: 217, type: !244)
!377 = !DILocalVariable(name: "key", scope: !369, file: !3, line: 222, type: !123)
!378 = !DILocalVariable(name: "off", scope: !369, file: !3, line: 228, type: !31)
!379 = !DILocalVariable(name: "done_parsing", scope: !369, file: !3, line: 228, type: !31)
!380 = !DILocalVariable(name: "key_len", scope: !369, file: !3, line: 228, type: !31)
!381 = !DILocalVariable(name: "cache_idx", scope: !369, file: !3, line: 252, type: !51)
!382 = !DILocalVariable(name: "entry", scope: !369, file: !3, line: 253, type: !89)
!383 = !DILocalVariable(name: "i", scope: !384, file: !3, line: 261, type: !31)
!384 = distinct !DILexicalBlock(scope: !385, file: !3, line: 259, column: 48)
!385 = distinct !DILexicalBlock(scope: !369, file: !3, line: 259, column: 6)
!386 = !DILocalVariable(name: "stats", scope: !387, file: !3, line: 270, type: !228)
!387 = distinct !DILexicalBlock(scope: !385, file: !3, line: 268, column: 9)
!388 = !DILocation(line: 0, scope: !369)
!389 = !DILocation(line: 209, column: 38, scope: !369)
!390 = !DILocation(line: 209, column: 27, scope: !369)
!391 = !DILocation(line: 209, column: 19, scope: !369)
!392 = !DILocation(line: 210, column: 34, scope: !369)
!393 = !DILocation(line: 210, column: 23, scope: !369)
!394 = !DILocation(line: 210, column: 15, scope: !369)
!395 = !DILocation(line: 212, column: 2, scope: !369)
!396 = !DILocation(line: 212, column: 15, scope: !369)
!397 = !DILocation(line: 214, column: 14, scope: !398)
!398 = distinct !DILexicalBlock(scope: !369, file: !3, line: 214, column: 6)
!399 = !DILocation(line: 214, column: 6, scope: !369)
!400 = !DILocation(line: 217, column: 33, scope: !369)
!401 = !DILocation(line: 218, column: 7, scope: !402)
!402 = distinct !DILexicalBlock(scope: !369, file: !3, line: 218, column: 6)
!403 = !DILocation(line: 218, column: 6, scope: !369)
!404 = !DILocation(line: 222, column: 68, scope: !369)
!405 = !DILocation(line: 222, column: 30, scope: !369)
!406 = !DILocation(line: 223, column: 7, scope: !407)
!407 = distinct !DILexicalBlock(scope: !369, file: !3, line: 223, column: 6)
!408 = !DILocation(line: 223, column: 6, scope: !369)
!409 = !DILocation(line: 226, column: 7, scope: !369)
!410 = !DILocation(line: 226, column: 12, scope: !369)
!411 = !{!412, !256, i64 0}
!412 = !{!"memcached_key", !256, i64 0, !257, i64 4, !256, i64 256}
!413 = !DILocation(line: 232, column: 39, scope: !414)
!414 = distinct !DILexicalBlock(scope: !415, file: !3, line: 232, column: 2)
!415 = distinct !DILexicalBlock(scope: !369, file: !3, line: 232, column: 2)
!416 = !DILocation(line: 232, column: 49, scope: !414)
!417 = !DILocation(line: 232, column: 53, scope: !414)
!418 = !DILocation(line: 232, column: 56, scope: !414)
!419 = !DILocation(line: 232, column: 2, scope: !415)
!420 = !DILocation(line: 233, column: 7, scope: !421)
!421 = distinct !DILexicalBlock(scope: !422, file: !3, line: 233, column: 7)
!422 = distinct !DILexicalBlock(scope: !414, file: !3, line: 232, column: 76)
!423 = !DILocation(line: 233, column: 7, scope: !422)
!424 = !DILocation(line: 241, column: 14, scope: !425)
!425 = distinct !DILexicalBlock(scope: !426, file: !3, line: 240, column: 33)
!426 = distinct !DILexicalBlock(scope: !427, file: !3, line: 240, column: 12)
!427 = distinct !DILexicalBlock(scope: !421, file: !3, line: 237, column: 12)
!428 = !DILocation(line: 242, column: 14, scope: !425)
!429 = !DILocation(line: 243, column: 11, scope: !425)
!430 = !DILocation(line: 232, column: 72, scope: !414)
!431 = !DILocation(line: 232, column: 20, scope: !414)
!432 = distinct !{!432, !419, !433, !348}
!433 = !DILocation(line: 245, column: 2, scope: !415)
!434 = !DILocation(line: 247, column: 19, scope: !435)
!435 = distinct !DILexicalBlock(scope: !369, file: !3, line: 247, column: 6)
!436 = !DILocation(line: 248, column: 23, scope: !437)
!437 = distinct !DILexicalBlock(scope: !435, file: !3, line: 247, column: 48)
!438 = !DILocation(line: 248, column: 148, scope: !437)
!439 = !DILocation(line: 248, column: 142, scope: !437)
!440 = !DILocation(line: 248, column: 30, scope: !437)
!441 = !DILocation(line: 248, column: 3, scope: !437)
!442 = !DILocation(line: 249, column: 3, scope: !437)
!443 = !DILocation(line: 252, column: 2, scope: !369)
!444 = !DILocation(line: 252, column: 28, scope: !369)
!445 = !DILocation(line: 252, column: 6, scope: !369)
!446 = !DILocation(line: 253, column: 40, scope: !369)
!447 = !DILocation(line: 254, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !369, file: !3, line: 254, column: 6)
!449 = !DILocation(line: 254, column: 6, scope: !369)
!450 = !DILocation(line: 258, column: 24, scope: !369)
!451 = !DILocation(line: 258, column: 2, scope: !369)
!452 = !DILocation(line: 259, column: 13, scope: !385)
!453 = !{!454, !257, i64 8}
!454 = !{!"memcached_cache_entry", !455, i64 0, !256, i64 4, !257, i64 8, !256, i64 12, !256, i64 16, !257, i64 20}
!455 = !{!"bpf_spin_lock", !256, i64 0}
!456 = !DILocation(line: 259, column: 6, scope: !385)
!457 = !DILocation(line: 259, column: 19, scope: !385)
!458 = !DILocation(line: 259, column: 29, scope: !385)
!459 = !{!454, !256, i64 12}
!460 = !DILocation(line: 259, column: 42, scope: !385)
!461 = !DILocation(line: 259, column: 34, scope: !385)
!462 = !DILocation(line: 259, column: 6, scope: !369)
!463 = !DILocation(line: 260, column: 3, scope: !384)
!464 = !DILocation(line: 0, scope: !384)
!465 = !DILocation(line: 0, scope: !466)
!466 = distinct !DILexicalBlock(scope: !467, file: !3, line: 263, column: 55)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 263, column: 3)
!468 = distinct !DILexicalBlock(scope: !384, file: !3, line: 263, column: 3)
!469 = !DILocation(line: 263, column: 12, scope: !467)
!470 = !DILocation(line: 263, column: 22, scope: !467)
!471 = !DILocation(line: 263, column: 32, scope: !467)
!472 = !DILocation(line: 263, column: 34, scope: !467)
!473 = !DILocation(line: 263, column: 37, scope: !467)
!474 = !DILocation(line: 263, column: 3, scope: !468)
!475 = !DILocation(line: 264, column: 19, scope: !466)
!476 = !DILocation(line: 264, column: 4, scope: !466)
!477 = !DILocation(line: 264, column: 17, scope: !466)
!478 = !DILocation(line: 263, column: 51, scope: !467)
!479 = distinct !{!479, !474, !480, !348}
!480 = !DILocation(line: 265, column: 3, scope: !468)
!481 = !DILocation(line: 266, column: 8, scope: !384)
!482 = !DILocation(line: 266, column: 12, scope: !384)
!483 = !{!412, !256, i64 256}
!484 = !DILocation(line: 268, column: 2, scope: !384)
!485 = !DILocation(line: 269, column: 3, scope: !387)
!486 = !DILocation(line: 270, column: 39, scope: !387)
!487 = !DILocation(line: 0, scope: !387)
!488 = !DILocation(line: 271, column: 8, scope: !489)
!489 = distinct !DILexicalBlock(scope: !387, file: !3, line: 271, column: 7)
!490 = !DILocation(line: 271, column: 7, scope: !387)
!491 = !DILocation(line: 274, column: 10, scope: !387)
!492 = !DILocation(line: 0, scope: !385)
!493 = !DILocation(line: 277, column: 6, scope: !494)
!494 = distinct !DILexicalBlock(scope: !369, file: !3, line: 277, column: 6)
!495 = !DILocation(line: 277, column: 6, scope: !369)
!496 = !DILocation(line: 278, column: 23, scope: !497)
!497 = distinct !DILexicalBlock(scope: !494, file: !3, line: 277, column: 20)
!498 = !DILocation(line: 278, column: 148, scope: !497)
!499 = !DILocation(line: 278, column: 142, scope: !497)
!500 = !DILocation(line: 278, column: 30, scope: !497)
!501 = !DILocation(line: 278, column: 3, scope: !497)
!502 = !DILocation(line: 279, column: 13, scope: !503)
!503 = distinct !DILexicalBlock(scope: !497, file: !3, line: 279, column: 7)
!504 = !DILocation(line: 279, column: 23, scope: !503)
!505 = !DILocation(line: 279, column: 7, scope: !497)
!506 = !DILocation(line: 280, column: 4, scope: !507)
!507 = distinct !DILexicalBlock(scope: !503, file: !3, line: 279, column: 28)
!508 = !DILocation(line: 281, column: 3, scope: !507)
!509 = !DILocation(line: 283, column: 6, scope: !510)
!510 = distinct !DILexicalBlock(scope: !494, file: !3, line: 282, column: 9)
!511 = !DILocation(line: 284, column: 9, scope: !510)
!512 = !DILocation(line: 284, column: 25, scope: !510)
!513 = !DILocation(line: 285, column: 27, scope: !514)
!514 = distinct !DILexicalBlock(scope: !510, file: !3, line: 285, column: 7)
!515 = !DILocation(line: 285, column: 7, scope: !514)
!516 = !DILocation(line: 285, column: 7, scope: !510)
!517 = !DILocation(line: 287, column: 3, scope: !510)
!518 = !DILocation(line: 291, column: 1, scope: !369)
!519 = distinct !DISubprogram(name: "xdp_memcached_rx_get_adjust_pkt_main", scope: !3, file: !3, line: 294, type: !176, scopeLine: 295, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !539, !540, !541, !542, !543, !544}
!521 = !DILocalVariable(name: "ctx", arg: 1, scope: !519, file: !3, line: 294, type: !178)
!522 = !DILocalVariable(name: "data_end", scope: !519, file: !3, line: 299, type: !6)
!523 = !DILocalVariable(name: "data", scope: !519, file: !3, line: 300, type: !6)
!524 = !DILocalVariable(name: "eth", scope: !519, file: !3, line: 301, type: !191)
!525 = !DILocalVariable(name: "ip", scope: !519, file: !3, line: 302, type: !201)
!526 = !DILocalVariable(name: "udp", scope: !519, file: !3, line: 303, type: !8)
!527 = !DILocalVariable(name: "memcached_udp_hdr", scope: !519, file: !3, line: 304, type: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "memcached_udp_header", file: !3, line: 47, size: 64, elements: !530)
!530 = !{!531, !532, !533, !534, !535}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !529, file: !3, line: 48, baseType: !13, size: 16)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !529, file: !3, line: 49, baseType: !13, size: 16, offset: 16)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "num_dgram", scope: !529, file: !3, line: 50, baseType: !13, size: 16, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !529, file: !3, line: 51, baseType: !13, size: 16, offset: 48)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !529, file: !3, line: 52, baseType: !536, offset: 64)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: -1)
!539 = !DILocalVariable(name: "payload", scope: !519, file: !3, line: 305, type: !46)
!540 = !DILocalVariable(name: "old_data", scope: !519, file: !3, line: 306, type: !6)
!541 = !DILocalVariable(name: "old_payload", scope: !519, file: !3, line: 307, type: !46)
!542 = !DILocalVariable(name: "tmp_mac", scope: !519, file: !3, line: 315, type: !196)
!543 = !DILocalVariable(name: "tmp_ip", scope: !519, file: !3, line: 316, type: !29)
!544 = !DILocalVariable(name: "tmp_port", scope: !519, file: !3, line: 317, type: !13)
!545 = !DILocation(line: 0, scope: !519)
!546 = !DILocation(line: 296, column: 26, scope: !547)
!547 = distinct !DILexicalBlock(scope: !519, file: !3, line: 296, column: 6)
!548 = !DILocation(line: 296, column: 6, scope: !547)
!549 = !DILocation(line: 296, column: 6, scope: !519)
!550 = !DILocation(line: 299, column: 38, scope: !519)
!551 = !DILocation(line: 299, column: 27, scope: !519)
!552 = !DILocation(line: 299, column: 19, scope: !519)
!553 = !DILocation(line: 300, column: 34, scope: !519)
!554 = !DILocation(line: 300, column: 23, scope: !519)
!555 = !DILocation(line: 300, column: 15, scope: !519)
!556 = !DILocation(line: 301, column: 23, scope: !519)
!557 = !DILocation(line: 305, column: 46, scope: !519)
!558 = !DILocation(line: 309, column: 14, scope: !559)
!559 = distinct !DILexicalBlock(scope: !519, file: !3, line: 309, column: 6)
!560 = !DILocation(line: 309, column: 40, scope: !559)
!561 = !DILocation(line: 309, column: 43, scope: !559)
!562 = !DILocation(line: 309, column: 26, scope: !559)
!563 = !DILocation(line: 306, column: 24, scope: !519)
!564 = !DILocation(line: 303, column: 43, scope: !519)
!565 = !DILocation(line: 313, column: 2, scope: !519)
!566 = !DILocation(line: 315, column: 2, scope: !519)
!567 = !DILocation(line: 315, column: 16, scope: !519)
!568 = !DILocation(line: 319, column: 2, scope: !519)
!569 = !DILocation(line: 320, column: 2, scope: !519)
!570 = !DILocation(line: 321, column: 2, scope: !519)
!571 = !DILocation(line: 323, column: 15, scope: !519)
!572 = !{!272, !256, i64 12}
!573 = !DILocation(line: 324, column: 18, scope: !519)
!574 = !{!272, !256, i64 16}
!575 = !DILocation(line: 324, column: 12, scope: !519)
!576 = !DILocation(line: 325, column: 12, scope: !519)
!577 = !DILocation(line: 327, column: 18, scope: !519)
!578 = !{!579, !273, i64 0}
!579 = !{!"udphdr", !273, i64 0, !273, i64 2, !273, i64 4, !273, i64 6}
!580 = !DILocation(line: 328, column: 21, scope: !519)
!581 = !{!579, !273, i64 2}
!582 = !DILocation(line: 328, column: 14, scope: !519)
!583 = !DILocation(line: 329, column: 12, scope: !519)
!584 = !DILocation(line: 331, column: 6, scope: !585)
!585 = distinct !DILexicalBlock(scope: !519, file: !3, line: 331, column: 6)
!586 = !DILocation(line: 331, column: 6, scope: !519)
!587 = !DILocation(line: 334, column: 2, scope: !519)
!588 = !DILocation(line: 336, column: 2, scope: !519)
!589 = !DILocation(line: 337, column: 1, scope: !519)
!590 = distinct !DISubprogram(name: "xdp_memcached_rx_get_write_pkt_main", scope: !3, file: !3, line: 340, type: !176, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !607, !610, !611, !616, !617, !618}
!592 = !DILocalVariable(name: "ctx", arg: 1, scope: !590, file: !3, line: 340, type: !178)
!593 = !DILocalVariable(name: "data_end", scope: !590, file: !3, line: 342, type: !6)
!594 = !DILocalVariable(name: "data", scope: !590, file: !3, line: 343, type: !6)
!595 = !DILocalVariable(name: "payload", scope: !590, file: !3, line: 344, type: !46)
!596 = !DILocalVariable(name: "zero", scope: !590, file: !3, line: 345, type: !31)
!597 = !DILocalVariable(name: "pctx", scope: !590, file: !3, line: 350, type: !244)
!598 = !DILocalVariable(name: "key", scope: !590, file: !3, line: 355, type: !123)
!599 = !DILocalVariable(name: "cache_hit", scope: !590, file: !3, line: 360, type: !31)
!600 = !DILocalVariable(name: "written", scope: !590, file: !3, line: 360, type: !31)
!601 = !DILocalVariable(name: "cache_idx", scope: !590, file: !3, line: 361, type: !51)
!602 = !DILocalVariable(name: "entry", scope: !590, file: !3, line: 362, type: !89)
!603 = !DILocalVariable(name: "i", scope: !604, file: !3, line: 370, type: !50)
!604 = distinct !DILexicalBlock(scope: !605, file: !3, line: 370, column: 3)
!605 = distinct !DILexicalBlock(scope: !606, file: !3, line: 368, column: 48)
!606 = distinct !DILexicalBlock(scope: !590, file: !3, line: 368, column: 6)
!607 = !DILocalVariable(name: "off", scope: !608, file: !3, line: 376, type: !31)
!608 = distinct !DILexicalBlock(scope: !609, file: !3, line: 375, column: 18)
!609 = distinct !DILexicalBlock(scope: !605, file: !3, line: 375, column: 7)
!610 = !DILocalVariable(name: "stats", scope: !590, file: !3, line: 396, type: !228)
!611 = !DILocalVariable(name: "data_end", scope: !612, file: !3, line: 421, type: !6)
!612 = distinct !DILexicalBlock(scope: !613, file: !3, line: 409, column: 38)
!613 = distinct !DILexicalBlock(scope: !614, file: !3, line: 409, column: 7)
!614 = distinct !DILexicalBlock(scope: !615, file: !3, line: 408, column: 91)
!615 = distinct !DILexicalBlock(scope: !590, file: !3, line: 408, column: 6)
!616 = !DILocalVariable(name: "data", scope: !612, file: !3, line: 422, type: !6)
!617 = !DILocalVariable(name: "ip", scope: !612, file: !3, line: 423, type: !201)
!618 = !DILocalVariable(name: "udp", scope: !612, file: !3, line: 424, type: !8)
!619 = !DILocation(line: 0, scope: !590)
!620 = !DILocation(line: 342, column: 38, scope: !590)
!621 = !DILocation(line: 342, column: 27, scope: !590)
!622 = !DILocation(line: 342, column: 19, scope: !590)
!623 = !DILocation(line: 343, column: 34, scope: !590)
!624 = !DILocation(line: 343, column: 23, scope: !590)
!625 = !DILocation(line: 343, column: 15, scope: !590)
!626 = !DILocation(line: 345, column: 2, scope: !590)
!627 = !DILocation(line: 345, column: 15, scope: !590)
!628 = !DILocation(line: 347, column: 14, scope: !629)
!629 = distinct !DILexicalBlock(scope: !590, file: !3, line: 347, column: 6)
!630 = !DILocation(line: 347, column: 6, scope: !590)
!631 = !DILocation(line: 350, column: 33, scope: !590)
!632 = !DILocation(line: 351, column: 7, scope: !633)
!633 = distinct !DILexicalBlock(scope: !590, file: !3, line: 351, column: 6)
!634 = !DILocation(line: 351, column: 6, scope: !590)
!635 = !DILocation(line: 355, column: 68, scope: !590)
!636 = !DILocation(line: 355, column: 30, scope: !590)
!637 = !DILocation(line: 356, column: 7, scope: !638)
!638 = distinct !DILexicalBlock(scope: !590, file: !3, line: 356, column: 6)
!639 = !DILocation(line: 356, column: 6, scope: !590)
!640 = !DILocation(line: 361, column: 2, scope: !590)
!641 = !DILocation(line: 361, column: 23, scope: !590)
!642 = !DILocation(line: 361, column: 28, scope: !590)
!643 = !DILocation(line: 361, column: 6, scope: !590)
!644 = !DILocation(line: 362, column: 40, scope: !590)
!645 = !DILocation(line: 363, column: 7, scope: !646)
!646 = distinct !DILexicalBlock(scope: !590, file: !3, line: 363, column: 6)
!647 = !DILocation(line: 363, column: 6, scope: !590)
!648 = !DILocation(line: 367, column: 24, scope: !590)
!649 = !DILocation(line: 367, column: 2, scope: !590)
!650 = !DILocation(line: 368, column: 13, scope: !606)
!651 = !DILocation(line: 368, column: 6, scope: !606)
!652 = !DILocation(line: 368, column: 19, scope: !606)
!653 = !DILocation(line: 368, column: 27, scope: !606)
!654 = !DILocation(line: 368, column: 42, scope: !606)
!655 = !DILocation(line: 368, column: 32, scope: !606)
!656 = !DILocation(line: 368, column: 6, scope: !590)
!657 = !DILocation(line: 370, column: 50, scope: !658)
!658 = distinct !DILexicalBlock(scope: !604, file: !3, line: 370, column: 3)
!659 = !DILocation(line: 0, scope: !604)
!660 = !DILocation(line: 0, scope: !658)
!661 = !DILocation(line: 0, scope: !662)
!662 = distinct !DILexicalBlock(scope: !663, file: !3, line: 371, column: 8)
!663 = distinct !DILexicalBlock(scope: !658, file: !3, line: 370, column: 60)
!664 = !DILocation(line: 370, column: 43, scope: !658)
!665 = !DILocation(line: 370, column: 38, scope: !658)
!666 = !DILocation(line: 370, column: 3, scope: !604)
!667 = !DILocation(line: 375, column: 7, scope: !609)
!668 = !DILocation(line: 375, column: 7, scope: !605)
!669 = !DILocation(line: 378, column: 115, scope: !670)
!670 = distinct !DILexicalBlock(scope: !671, file: !3, line: 378, column: 4)
!671 = distinct !DILexicalBlock(scope: !608, file: !3, line: 378, column: 4)
!672 = !DILocation(line: 0, scope: !608)
!673 = !DILocation(line: 0, scope: !670)
!674 = !{!454, !256, i64 4}
!675 = !DILocation(line: 378, column: 71, scope: !670)
!676 = !DILocation(line: 371, column: 8, scope: !662)
!677 = !DILocation(line: 371, column: 37, scope: !662)
!678 = !DILocation(line: 371, column: 24, scope: !662)
!679 = !DILocation(line: 371, column: 21, scope: !662)
!680 = !DILocation(line: 371, column: 8, scope: !663)
!681 = !DILocation(line: 370, column: 56, scope: !658)
!682 = !DILocation(line: 370, column: 21, scope: !658)
!683 = distinct !{!683, !666, !684, !348}
!684 = !DILocation(line: 374, column: 3, scope: !604)
!685 = !DILocation(line: 378, column: 105, scope: !670)
!686 = !DILocation(line: 378, column: 119, scope: !670)
!687 = !DILocation(line: 378, column: 129, scope: !670)
!688 = !DILocation(line: 378, column: 133, scope: !670)
!689 = !DILocation(line: 378, column: 161, scope: !670)
!690 = !DILocation(line: 378, column: 4, scope: !671)
!691 = !DILocation(line: 379, column: 73, scope: !692)
!692 = distinct !DILexicalBlock(scope: !670, file: !3, line: 378, column: 181)
!693 = !DILocation(line: 379, column: 47, scope: !692)
!694 = !{!695, !695, i64 0}
!695 = !{!"long long", !257, i64 0}
!696 = !DILocation(line: 379, column: 5, scope: !692)
!697 = !DILocation(line: 379, column: 45, scope: !692)
!698 = !DILocation(line: 381, column: 13, scope: !692)
!699 = !DILocation(line: 378, column: 18, scope: !670)
!700 = !DILocation(line: 378, column: 21, scope: !670)
!701 = !DILocation(line: 378, column: 49, scope: !670)
!702 = distinct !{!702, !690, !703, !348}
!703 = !DILocation(line: 382, column: 4, scope: !671)
!704 = !DILocation(line: 0, scope: !671)
!705 = !DILocation(line: 384, column: 15, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !3, line: 384, column: 4)
!707 = distinct !DILexicalBlock(scope: !608, file: !3, line: 384, column: 4)
!708 = !DILocation(line: 384, column: 37, scope: !706)
!709 = !DILocation(line: 0, scope: !706)
!710 = !DILocation(line: 384, column: 44, scope: !706)
!711 = !DILocation(line: 384, column: 71, scope: !706)
!712 = !DILocation(line: 384, column: 74, scope: !706)
!713 = !DILocation(line: 384, column: 57, scope: !706)
!714 = !DILocation(line: 385, column: 20, scope: !715)
!715 = distinct !DILexicalBlock(scope: !706, file: !3, line: 384, column: 94)
!716 = !DILocation(line: 385, column: 5, scope: !715)
!717 = !DILocation(line: 385, column: 18, scope: !715)
!718 = !DILocation(line: 386, column: 13, scope: !715)
!719 = !DILocation(line: 384, column: 90, scope: !706)
!720 = distinct !{!720, !721, !722, !348}
!721 = !DILocation(line: 384, column: 4, scope: !707)
!722 = !DILocation(line: 387, column: 4, scope: !707)
!723 = !DILocation(line: 384, column: 53, scope: !706)
!724 = !DILocation(line: 388, column: 15, scope: !725)
!725 = distinct !DILexicalBlock(scope: !608, file: !3, line: 388, column: 8)
!726 = !DILocation(line: 388, column: 21, scope: !725)
!727 = !DILocation(line: 388, column: 8, scope: !608)
!728 = !DILocation(line: 389, column: 17, scope: !729)
!729 = distinct !DILexicalBlock(scope: !725, file: !3, line: 388, column: 52)
!730 = !DILocation(line: 390, column: 4, scope: !729)
!731 = !DILocation(line: 391, column: 11, scope: !608)
!732 = !DILocation(line: 391, column: 22, scope: !608)
!733 = !{!454, !256, i64 16}
!734 = !DILocation(line: 392, column: 3, scope: !608)
!735 = !DILocation(line: 360, column: 30, scope: !590)
!736 = !DILocation(line: 360, column: 15, scope: !590)
!737 = !DILocation(line: 394, column: 2, scope: !590)
!738 = !DILocation(line: 396, column: 38, scope: !590)
!739 = !DILocation(line: 397, column: 7, scope: !740)
!740 = distinct !DILexicalBlock(scope: !590, file: !3, line: 397, column: 6)
!741 = !DILocation(line: 397, column: 6, scope: !590)
!742 = !DILocation(line: 400, column: 6, scope: !743)
!743 = distinct !DILexicalBlock(scope: !590, file: !3, line: 400, column: 6)
!744 = !DILocation(line: 400, column: 6, scope: !590)
!745 = !DILocation(line: 0, scope: !743)
!746 = !DILocation(line: 406, column: 19, scope: !590)
!747 = !DILocation(line: 408, column: 33, scope: !615)
!748 = !DILocation(line: 408, column: 24, scope: !615)
!749 = !DILocation(line: 408, column: 43, scope: !615)
!750 = !DILocation(line: 408, column: 53, scope: !615)
!751 = !DILocation(line: 408, column: 70, scope: !615)
!752 = !DILocation(line: 408, column: 85, scope: !615)
!753 = !DILocation(line: 408, column: 74, scope: !615)
!754 = !DILocation(line: 409, column: 14, scope: !613)
!755 = !DILocation(line: 409, column: 22, scope: !613)
!756 = !DILocation(line: 409, column: 25, scope: !613)
!757 = !DILocation(line: 409, column: 7, scope: !614)
!758 = !DILocation(line: 410, column: 19, scope: !612)
!759 = !DILocation(line: 410, column: 23, scope: !612)
!760 = !DILocation(line: 411, column: 19, scope: !612)
!761 = !DILocation(line: 411, column: 4, scope: !612)
!762 = !DILocation(line: 411, column: 23, scope: !612)
!763 = !DILocation(line: 412, column: 19, scope: !612)
!764 = !DILocation(line: 412, column: 4, scope: !612)
!765 = !DILocation(line: 412, column: 23, scope: !612)
!766 = !DILocation(line: 413, column: 19, scope: !612)
!767 = !DILocation(line: 413, column: 4, scope: !612)
!768 = !DILocation(line: 413, column: 23, scope: !612)
!769 = !DILocation(line: 414, column: 19, scope: !612)
!770 = !DILocation(line: 414, column: 4, scope: !612)
!771 = !DILocation(line: 414, column: 23, scope: !612)
!772 = !DILocation(line: 416, column: 28, scope: !773)
!773 = distinct !DILexicalBlock(scope: !612, file: !3, line: 416, column: 8)
!774 = !DILocation(line: 417, column: 60, scope: !773)
!775 = !DILocation(line: 417, column: 54, scope: !773)
!776 = !DILocation(line: 416, column: 35, scope: !773)
!777 = !DILocation(line: 416, column: 8, scope: !773)
!778 = !DILocation(line: 416, column: 8, scope: !612)
!779 = !DILocation(line: 421, column: 40, scope: !612)
!780 = !DILocation(line: 421, column: 29, scope: !612)
!781 = !DILocation(line: 0, scope: !612)
!782 = !DILocation(line: 422, column: 36, scope: !612)
!783 = !DILocation(line: 422, column: 25, scope: !612)
!784 = !DILocation(line: 422, column: 17, scope: !612)
!785 = !DILocation(line: 423, column: 28, scope: !612)
!786 = !DILocation(line: 427, column: 12, scope: !787)
!787 = distinct !DILexicalBlock(scope: !612, file: !3, line: 427, column: 8)
!788 = !DILocation(line: 427, column: 18, scope: !787)
!789 = !DILocation(line: 427, column: 16, scope: !787)
!790 = !DILocation(line: 427, column: 8, scope: !612)
!791 = !DILocation(line: 425, column: 72, scope: !612)
!792 = !DILocation(line: 424, column: 54, scope: !612)
!793 = !DILocation(line: 430, column: 18, scope: !612)
!794 = !DILocation(line: 430, column: 8, scope: !612)
!795 = !DILocation(line: 430, column: 16, scope: !612)
!796 = !{!272, !273, i64 2}
!797 = !DILocalVariable(name: "ip", arg: 1, scope: !798, file: !3, line: 121, type: !201)
!798 = distinct !DISubprogram(name: "compute_ip_checksum", scope: !3, file: !3, line: 121, type: !799, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !801)
!799 = !DISubroutineType(types: !800)
!800 = !{!54, !201}
!801 = !{!797, !802, !803, !804}
!802 = !DILocalVariable(name: "csum", scope: !798, file: !3, line: 123, type: !51)
!803 = !DILocalVariable(name: "next_ip_u16", scope: !798, file: !3, line: 124, type: !53)
!804 = !DILocalVariable(name: "i", scope: !805, file: !3, line: 129, type: !50)
!805 = distinct !DILexicalBlock(scope: !798, file: !3, line: 129, column: 5)
!806 = !DILocation(line: 0, scope: !798, inlinedAt: !807)
!807 = distinct !DILocation(line: 431, column: 16, scope: !612)
!808 = !DILocation(line: 124, column: 24, scope: !798, inlinedAt: !807)
!809 = !DILocation(line: 126, column: 9, scope: !798, inlinedAt: !807)
!810 = !DILocation(line: 0, scope: !805, inlinedAt: !807)
!811 = !DILocation(line: 130, column: 17, scope: !812, inlinedAt: !807)
!812 = distinct !DILexicalBlock(scope: !805, file: !3, line: 129, column: 5)
!813 = !DILocation(line: 130, column: 29, scope: !812, inlinedAt: !807)
!814 = !DILocation(line: 130, column: 14, scope: !812, inlinedAt: !807)
!815 = !DILocation(line: 132, column: 35, scope: !798, inlinedAt: !807)
!816 = !DILocation(line: 132, column: 27, scope: !798, inlinedAt: !807)
!817 = !DILocation(line: 132, column: 9, scope: !798, inlinedAt: !807)
!818 = !DILocation(line: 431, column: 14, scope: !612)
!819 = !{!272, !273, i64 10}
!820 = !DILocation(line: 432, column: 9, scope: !612)
!821 = !DILocation(line: 432, column: 15, scope: !612)
!822 = !{!579, !273, i64 6}
!823 = !DILocation(line: 433, column: 15, scope: !612)
!824 = !DILocation(line: 433, column: 9, scope: !612)
!825 = !DILocation(line: 433, column: 13, scope: !612)
!826 = !{!579, !273, i64 4}
!827 = !DILocation(line: 435, column: 33, scope: !612)
!828 = !DILocation(line: 435, column: 31, scope: !612)
!829 = !DILocation(line: 435, column: 4, scope: !612)
!830 = !DILocation(line: 437, column: 4, scope: !612)
!831 = !DILocation(line: 440, column: 10, scope: !832)
!832 = distinct !DILexicalBlock(scope: !833, file: !3, line: 439, column: 51)
!833 = distinct !DILexicalBlock(scope: !615, file: !3, line: 439, column: 13)
!834 = !DILocation(line: 440, column: 28, scope: !832)
!835 = !{!319, !256, i64 12}
!836 = !DILocation(line: 441, column: 23, scope: !832)
!837 = !DILocation(line: 441, column: 3, scope: !832)
!838 = !DILocation(line: 442, column: 3, scope: !832)
!839 = !DILocation(line: 443, column: 31, scope: !840)
!840 = distinct !DILexicalBlock(scope: !833, file: !3, line: 443, column: 13)
!841 = !DILocation(line: 443, column: 13, scope: !833)
!842 = !DILocation(line: 444, column: 9, scope: !843)
!843 = distinct !DILexicalBlock(scope: !840, file: !3, line: 443, column: 52)
!844 = !DILocation(line: 444, column: 26, scope: !843)
!845 = !DILocation(line: 445, column: 27, scope: !846)
!846 = distinct !DILexicalBlock(scope: !843, file: !3, line: 445, column: 7)
!847 = !DILocation(line: 445, column: 7, scope: !846)
!848 = !DILocation(line: 445, column: 7, scope: !843)
!849 = !DILocation(line: 447, column: 3, scope: !843)
!850 = !DILocation(line: 448, column: 2, scope: !843)
!851 = !DILocation(line: 451, column: 1, scope: !590)
!852 = distinct !DISubprogram(name: "xdp_memcached_rx_set_parse_main", scope: !3, file: !3, line: 454, type: !176, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !868, !877, !878}
!854 = !DILocalVariable(name: "ctx", arg: 1, scope: !852, file: !3, line: 454, type: !178)
!855 = !DILocalVariable(name: "data_end", scope: !852, file: !3, line: 456, type: !6)
!856 = !DILocalVariable(name: "data", scope: !852, file: !3, line: 457, type: !6)
!857 = !DILocalVariable(name: "eth", scope: !852, file: !3, line: 458, type: !191)
!858 = !DILocalVariable(name: "ip", scope: !852, file: !3, line: 459, type: !201)
!859 = !DILocalVariable(name: "tcp", scope: !852, file: !3, line: 460, type: !22)
!860 = !DILocalVariable(name: "payload", scope: !852, file: !3, line: 461, type: !46)
!861 = !DILocalVariable(name: "zero", scope: !852, file: !3, line: 462, type: !31)
!862 = !DILocalVariable(name: "stats", scope: !852, file: !3, line: 467, type: !228)
!863 = !DILocalVariable(name: "hash", scope: !852, file: !3, line: 472, type: !51)
!864 = !DILocalVariable(name: "set_found", scope: !852, file: !3, line: 473, type: !50)
!865 = !DILocalVariable(name: "key_found", scope: !852, file: !3, line: 473, type: !50)
!866 = !DILocalVariable(name: "off", scope: !867, file: !3, line: 476, type: !31)
!867 = distinct !DILexicalBlock(scope: !852, file: !3, line: 476, column: 2)
!868 = !DILocalVariable(name: "cache_idx", scope: !869, file: !3, line: 496, type: !51)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 495, column: 29)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 495, column: 8)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 494, column: 28)
!872 = distinct !DILexicalBlock(scope: !873, file: !3, line: 494, column: 12)
!873 = distinct !DILexicalBlock(scope: !874, file: !3, line: 483, column: 12)
!874 = distinct !DILexicalBlock(scope: !875, file: !3, line: 478, column: 7)
!875 = distinct !DILexicalBlock(scope: !876, file: !3, line: 476, column: 90)
!876 = distinct !DILexicalBlock(scope: !867, file: !3, line: 476, column: 2)
!877 = !DILocalVariable(name: "entry", scope: !869, file: !3, line: 497, type: !89)
!878 = !DILocalVariable(name: "____fmt", scope: !879, file: !3, line: 521, type: !882)
!879 = distinct !DILexicalBlock(scope: !880, file: !3, line: 521, column: 3)
!880 = distinct !DILexicalBlock(scope: !881, file: !3, line: 520, column: 40)
!881 = distinct !DILexicalBlock(scope: !852, file: !3, line: 520, column: 6)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 576, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 72)
!885 = !DILocation(line: 0, scope: !852)
!886 = !DILocation(line: 456, column: 38, scope: !852)
!887 = !DILocation(line: 456, column: 27, scope: !852)
!888 = !DILocation(line: 456, column: 19, scope: !852)
!889 = !DILocation(line: 457, column: 34, scope: !852)
!890 = !DILocation(line: 457, column: 23, scope: !852)
!891 = !DILocation(line: 457, column: 15, scope: !852)
!892 = !DILocation(line: 461, column: 32, scope: !852)
!893 = !DILocation(line: 462, column: 2, scope: !852)
!894 = !DILocation(line: 462, column: 15, scope: !852)
!895 = !DILocation(line: 464, column: 14, scope: !896)
!896 = distinct !DILexicalBlock(scope: !852, file: !3, line: 464, column: 6)
!897 = !DILocation(line: 464, column: 6, scope: !852)
!898 = !DILocation(line: 467, column: 38, scope: !852)
!899 = !DILocation(line: 468, column: 7, scope: !900)
!900 = distinct !DILexicalBlock(scope: !852, file: !3, line: 468, column: 6)
!901 = !DILocation(line: 468, column: 6, scope: !852)
!902 = !DILocation(line: 0, scope: !867)
!903 = !DILocation(line: 0, scope: !904)
!904 = distinct !DILexicalBlock(scope: !874, file: !3, line: 478, column: 125)
!905 = !DILocation(line: 0, scope: !869)
!906 = !DILocation(line: 0, scope: !907)
!907 = distinct !DILexicalBlock(scope: !908, file: !3, line: 502, column: 46)
!908 = distinct !DILexicalBlock(scope: !869, file: !3, line: 502, column: 9)
!909 = !DILocation(line: 476, column: 53, scope: !876)
!910 = !DILocation(line: 476, column: 63, scope: !876)
!911 = !DILocation(line: 476, column: 67, scope: !876)
!912 = !DILocation(line: 476, column: 70, scope: !876)
!913 = !DILocation(line: 476, column: 2, scope: !867)
!914 = !DILocation(line: 478, column: 17, scope: !874)
!915 = !DILocation(line: 478, column: 22, scope: !874)
!916 = !DILocation(line: 478, column: 25, scope: !874)
!917 = !DILocation(line: 478, column: 38, scope: !874)
!918 = !DILocation(line: 478, column: 59, scope: !874)
!919 = !DILocation(line: 478, column: 62, scope: !874)
!920 = !DILocation(line: 478, column: 45, scope: !874)
!921 = !DILocation(line: 478, column: 88, scope: !874)
!922 = !DILocation(line: 478, column: 77, scope: !874)
!923 = !DILocation(line: 478, column: 92, scope: !874)
!924 = !DILocation(line: 478, column: 99, scope: !874)
!925 = !DILocation(line: 478, column: 113, scope: !874)
!926 = !DILocation(line: 478, column: 102, scope: !874)
!927 = !DILocation(line: 478, column: 117, scope: !874)
!928 = !DILocation(line: 478, column: 7, scope: !875)
!929 = !DILocation(line: 480, column: 8, scope: !904)
!930 = !DILocation(line: 481, column: 25, scope: !904)
!931 = !{!319, !256, i64 4}
!932 = !DILocation(line: 482, column: 3, scope: !904)
!933 = !DILocation(line: 483, column: 22, scope: !873)
!934 = !DILocation(line: 483, column: 40, scope: !873)
!935 = !DILocation(line: 483, column: 27, scope: !873)
!936 = !DILocation(line: 483, column: 48, scope: !873)
!937 = !DILocation(line: 483, column: 12, scope: !874)
!938 = !DILocation(line: 494, column: 12, scope: !873)
!939 = !DILocation(line: 489, column: 10, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !3, line: 487, column: 11)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 484, column: 8)
!942 = distinct !DILexicalBlock(scope: !873, file: !3, line: 483, column: 69)
!943 = !DILocation(line: 490, column: 10, scope: !940)
!944 = !DILocation(line: 494, column: 22, scope: !872)
!945 = !DILocation(line: 495, column: 8, scope: !870)
!946 = !DILocation(line: 495, column: 21, scope: !870)
!947 = !DILocation(line: 495, column: 8, scope: !871)
!948 = !DILocation(line: 496, column: 5, scope: !869)
!949 = !DILocation(line: 496, column: 26, scope: !869)
!950 = !DILocation(line: 496, column: 9, scope: !869)
!951 = !DILocation(line: 497, column: 43, scope: !869)
!952 = !DILocation(line: 498, column: 10, scope: !953)
!953 = distinct !DILexicalBlock(scope: !869, file: !3, line: 498, column: 9)
!954 = !DILocation(line: 498, column: 9, scope: !869)
!955 = !DILocation(line: 501, column: 27, scope: !869)
!956 = !DILocation(line: 501, column: 5, scope: !869)
!957 = !DILocation(line: 502, column: 16, scope: !908)
!958 = !DILocation(line: 502, column: 9, scope: !908)
!959 = !DILocation(line: 502, column: 22, scope: !908)
!960 = !DILocation(line: 502, column: 32, scope: !908)
!961 = !DILocation(line: 502, column: 37, scope: !908)
!962 = !DILocation(line: 502, column: 9, scope: !869)
!963 = !DILocation(line: 506, column: 19, scope: !907)
!964 = !DILocation(line: 507, column: 31, scope: !907)
!965 = !{!319, !256, i64 28}
!966 = !DILocation(line: 508, column: 5, scope: !907)
!967 = !DILocation(line: 509, column: 5, scope: !869)
!968 = !DILocation(line: 512, column: 4, scope: !870)
!969 = !DILocation(line: 514, column: 10, scope: !970)
!970 = distinct !DILexicalBlock(scope: !870, file: !3, line: 513, column: 9)
!971 = !DILocation(line: 515, column: 10, scope: !970)
!972 = !DILocation(line: 476, column: 86, scope: !876)
!973 = !DILocation(line: 476, column: 33, scope: !876)
!974 = distinct !{!974, !913, !975, !348}
!975 = !DILocation(line: 518, column: 2, scope: !867)
!976 = !DILocation(line: 473, column: 21, scope: !852)
!977 = !DILocation(line: 520, column: 16, scope: !881)
!978 = !DILocation(line: 520, column: 34, scope: !881)
!979 = !DILocation(line: 520, column: 21, scope: !881)
!980 = !DILocation(line: 521, column: 3, scope: !879)
!981 = !DILocation(line: 521, column: 3, scope: !880)
!982 = !DILocation(line: 522, column: 2, scope: !880)
!983 = !DILocation(line: 525, column: 1, scope: !852)
!984 = distinct !DISubprogram(name: "tc_memcached_tx_main", scope: !3, file: !3, line: 528, type: !985, scopeLine: 529, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1074)
!985 = !DISubroutineType(types: !986)
!986 = !{!50, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !95, line: 2934, size: 1408, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1016, !1017, !1018, !1019, !1020, !1050, !1052, !1053, !1054}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !988, file: !95, line: 2935, baseType: !30, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !988, file: !95, line: 2936, baseType: !30, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !988, file: !95, line: 2937, baseType: !30, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !988, file: !95, line: 2938, baseType: !30, size: 32, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !988, file: !95, line: 2939, baseType: !30, size: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !988, file: !95, line: 2940, baseType: !30, size: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !988, file: !95, line: 2941, baseType: !30, size: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !988, file: !95, line: 2942, baseType: !30, size: 32, offset: 224)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !988, file: !95, line: 2943, baseType: !30, size: 32, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !988, file: !95, line: 2944, baseType: !30, size: 32, offset: 288)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !988, file: !95, line: 2945, baseType: !30, size: 32, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !988, file: !95, line: 2946, baseType: !30, size: 32, offset: 352)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !988, file: !95, line: 2947, baseType: !1003, size: 160, offset: 384)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 5)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !988, file: !95, line: 2948, baseType: !30, size: 32, offset: 544)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !988, file: !95, line: 2949, baseType: !30, size: 32, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !988, file: !95, line: 2950, baseType: !30, size: 32, offset: 608)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !988, file: !95, line: 2951, baseType: !30, size: 32, offset: 640)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !988, file: !95, line: 2952, baseType: !30, size: 32, offset: 672)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !988, file: !95, line: 2955, baseType: !30, size: 32, offset: 704)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !988, file: !95, line: 2956, baseType: !30, size: 32, offset: 736)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !988, file: !95, line: 2957, baseType: !30, size: 32, offset: 768)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !988, file: !95, line: 2958, baseType: !1015, size: 128, offset: 800)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !75)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !988, file: !95, line: 2959, baseType: !1015, size: 128, offset: 928)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !988, file: !95, line: 2960, baseType: !30, size: 32, offset: 1056)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !988, file: !95, line: 2961, baseType: !30, size: 32, offset: 1088)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !988, file: !95, line: 2964, baseType: !30, size: 32, offset: 1120)
!1020 = !DIDerivedType(tag: DW_TAG_member, scope: !988, file: !95, line: 2965, baseType: !1021, size: 64, align: 64, offset: 1152)
!1021 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !988, file: !95, line: 2965, size: 64, align: 64, elements: !1022)
!1022 = !{!1023}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !1021, file: !95, line: 2965, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !95, line: 3510, size: 384, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !1025, file: !95, line: 3511, baseType: !15, size: 16)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !1025, file: !95, line: 3512, baseType: !15, size: 16, offset: 16)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !1025, file: !95, line: 3513, baseType: !15, size: 16, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !1025, file: !95, line: 3514, baseType: !206, size: 8, offset: 48)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !1025, file: !95, line: 3515, baseType: !206, size: 8, offset: 56)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !1025, file: !95, line: 3516, baseType: !206, size: 8, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !1025, file: !95, line: 3517, baseType: !206, size: 8, offset: 72)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !1025, file: !95, line: 3518, baseType: !13, size: 16, offset: 80)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !1025, file: !95, line: 3519, baseType: !13, size: 16, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !1025, file: !95, line: 3520, baseType: !13, size: 16, offset: 112)
!1037 = !DIDerivedType(tag: DW_TAG_member, scope: !1025, file: !95, line: 3521, baseType: !1038, size: 256, offset: 128)
!1038 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1025, file: !95, line: 3521, size: 256, elements: !1039)
!1039 = !{!1040, !1045}
!1040 = !DIDerivedType(tag: DW_TAG_member, scope: !1038, file: !95, line: 3522, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1038, file: !95, line: 3522, size: 64, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !1041, file: !95, line: 3523, baseType: !29, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !1041, file: !95, line: 3524, baseType: !29, size: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, scope: !1038, file: !95, line: 3526, baseType: !1046, size: 256)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1038, file: !95, line: 3526, size: 256, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !1046, file: !95, line: 3527, baseType: !1015, size: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !1046, file: !95, line: 3528, baseType: !1015, size: 128, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !988, file: !95, line: 2966, baseType: !1051, size: 64, offset: 1216)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !16, line: 31, baseType: !49)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !988, file: !95, line: 2967, baseType: !30, size: 32, offset: 1280)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !988, file: !95, line: 2968, baseType: !30, size: 32, offset: 1312)
!1054 = !DIDerivedType(tag: DW_TAG_member, scope: !988, file: !95, line: 2969, baseType: !1055, size: 64, align: 64, offset: 1344)
!1055 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !988, file: !95, line: 2969, size: 64, align: 64, elements: !1056)
!1056 = !{!1057}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !1055, file: !95, line: 2969, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !95, line: 3022, size: 608, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !1059, file: !95, line: 3023, baseType: !30, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1059, file: !95, line: 3024, baseType: !30, size: 32, offset: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1059, file: !95, line: 3025, baseType: !30, size: 32, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !1059, file: !95, line: 3026, baseType: !30, size: 32, offset: 96)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !1059, file: !95, line: 3027, baseType: !30, size: 32, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !1059, file: !95, line: 3028, baseType: !30, size: 32, offset: 160)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !1059, file: !95, line: 3030, baseType: !30, size: 32, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !1059, file: !95, line: 3031, baseType: !1015, size: 128, offset: 224)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !1059, file: !95, line: 3032, baseType: !30, size: 32, offset: 352)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !1059, file: !95, line: 3033, baseType: !30, size: 32, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !1059, file: !95, line: 3034, baseType: !30, size: 32, offset: 416)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !1059, file: !95, line: 3035, baseType: !1015, size: 128, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1059, file: !95, line: 3036, baseType: !30, size: 32, offset: 576)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084}
!1075 = !DILocalVariable(name: "skb", arg: 1, scope: !984, file: !3, line: 528, type: !987)
!1076 = !DILocalVariable(name: "data_end", scope: !984, file: !3, line: 530, type: !6)
!1077 = !DILocalVariable(name: "data", scope: !984, file: !3, line: 531, type: !6)
!1078 = !DILocalVariable(name: "eth", scope: !984, file: !3, line: 532, type: !191)
!1079 = !DILocalVariable(name: "ip", scope: !984, file: !3, line: 533, type: !201)
!1080 = !DILocalVariable(name: "udp", scope: !984, file: !3, line: 534, type: !8)
!1081 = !DILocalVariable(name: "payload", scope: !984, file: !3, line: 535, type: !46)
!1082 = !DILocalVariable(name: "zero", scope: !984, file: !3, line: 536, type: !31)
!1083 = !DILocalVariable(name: "sport", scope: !984, file: !3, line: 551, type: !13)
!1084 = !DILocalVariable(name: "stats", scope: !1085, file: !3, line: 556, type: !228)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 554, column: 67)
!1086 = distinct !DILexicalBlock(scope: !984, file: !3, line: 553, column: 6)
!1087 = !DILocation(line: 0, scope: !984)
!1088 = !DILocation(line: 530, column: 38, scope: !984)
!1089 = !{!1090, !256, i64 80}
!1090 = !{!"__sk_buff", !256, i64 0, !256, i64 4, !256, i64 8, !256, i64 12, !256, i64 16, !256, i64 20, !256, i64 24, !256, i64 28, !256, i64 32, !256, i64 36, !256, i64 40, !256, i64 44, !257, i64 48, !256, i64 68, !256, i64 72, !256, i64 76, !256, i64 80, !256, i64 84, !256, i64 88, !256, i64 92, !256, i64 96, !257, i64 100, !257, i64 116, !256, i64 132, !256, i64 136, !256, i64 140, !257, i64 144, !695, i64 152, !256, i64 160, !256, i64 164, !257, i64 168}
!1091 = !DILocation(line: 530, column: 27, scope: !984)
!1092 = !DILocation(line: 530, column: 19, scope: !984)
!1093 = !DILocation(line: 531, column: 38, scope: !984)
!1094 = !{!1090, !256, i64 76}
!1095 = !DILocation(line: 531, column: 27, scope: !984)
!1096 = !DILocation(line: 531, column: 19, scope: !984)
!1097 = !DILocation(line: 534, column: 43, scope: !984)
!1098 = !DILocation(line: 535, column: 67, scope: !984)
!1099 = !DILocation(line: 536, column: 2, scope: !984)
!1100 = !DILocation(line: 536, column: 15, scope: !984)
!1101 = !DILocation(line: 539, column: 11, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !984, file: !3, line: 539, column: 6)
!1103 = !{!1090, !256, i64 0}
!1104 = !DILocation(line: 539, column: 15, scope: !1102)
!1105 = !DILocation(line: 539, column: 6, scope: !984)
!1106 = !DILocation(line: 542, column: 9, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !984, file: !3, line: 542, column: 6)
!1108 = !DILocation(line: 542, column: 15, scope: !1107)
!1109 = !DILocation(line: 542, column: 13, scope: !1107)
!1110 = !DILocation(line: 542, column: 6, scope: !984)
!1111 = !DILocation(line: 545, column: 10, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !984, file: !3, line: 545, column: 6)
!1113 = !DILocation(line: 545, column: 19, scope: !1112)
!1114 = !DILocation(line: 545, column: 6, scope: !984)
!1115 = !DILocation(line: 548, column: 10, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !984, file: !3, line: 548, column: 6)
!1117 = !DILocation(line: 548, column: 16, scope: !1116)
!1118 = !DILocation(line: 548, column: 14, scope: !1116)
!1119 = !DILocation(line: 548, column: 6, scope: !984)
!1120 = !DILocation(line: 551, column: 22, scope: !984)
!1121 = !DILocation(line: 553, column: 12, scope: !1086)
!1122 = !DILocation(line: 553, column: 28, scope: !1086)
!1123 = !DILocation(line: 553, column: 38, scope: !1086)
!1124 = !DILocation(line: 553, column: 40, scope: !1086)
!1125 = !DILocation(line: 553, column: 43, scope: !1086)
!1126 = !DILocation(line: 553, column: 55, scope: !1086)
!1127 = !DILocation(line: 553, column: 58, scope: !1086)
!1128 = !DILocation(line: 553, column: 69, scope: !1086)
